### Part 1 :
- Theory and predict titanic survival using naive bayes

### Part 2 :
- Build email spam detector

<h1><center>PART 1</center></h1>

You all know that when you flip a coin the probability of getting head or tail is 1 by 2 because there are two possible outcomes and the chance of getting head or tail is 50%.

Similarly , When you pick a random card , what is the probability of getting a **queen** ?
  
- It's very simple there are total 4 queens 52 cards hence the probability of getting Queen.
    P(queen) = 4/52 = 1/13

Pic a random card, you know what it is a **diamond**. Now what is the probability of that card being a **queen** ?

This is called a **Conditional Probability** where you know even is A occurred and then now you are trying to predict the probability of B.

    Total Diamonds = 13

    Queen = 1
    
    P(queen/diamond) = 1/13  That is Conditional Probability
    
**P(A/B) = Probability of event A knowing that event B has already occured**

                P(B/A) * P(A) 
      P(A/B) = ---------------
                     P(B)
                     
                     
                          P(diamond/queen) * P(queen)
      P(queen/diamond) = ------------------------------
                                   P(diamond)
                                   
- P(diamond/queen) = 1/4
- P(queen) = 1/13
- P(diamond) = 1/4

<h3><center>We Have a data set About Titanic Crash</center></h3>

There are name of the people along with certain features. Here we can use Bayes Theorem where we are trying to find probability of survival based on the features such as if the person was male the class age cabin fare and so on 

                    Survived
      P(------------------------------------)
         Male & Class & Age & Cabin & Fare
         
      Make a naive assumption that features such as male, class, age, cabin, fare etc. are independent of each other

In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [15]:
target = df.Survived
input = df.drop('Survived',axis='columns')

In [16]:
dummies = pd.get_dummies(input.Sex, dtype=int)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [ ]:
input =